{
	"loader": "Loading...",
	"menu.levels": "LEVELS",
	"menu.parameters": "PARAMETERS",
	"menu.configuration": "Configuration",
	"menu.language": "Language",
	"menu.language.auto": "Automatic",
	"menu.language.english": "English",
	"menu.language.french": "French",
	"menu.animation": "Animation duration",
	"menu.audio": "Audio volume",
	"menu.storage": "Saving data",
	"menu.switch": "No / Yes",
	"menu.keyboard": "Keys to play",
	"menu.keyboard.top": "Move to top right",
	"menu.keyboard.left": "Move to top left",
	"menu.keyboard.bot": "Move to down left",
	"menu.keyboard.right": "Move to down right",
	"menu.keyboard.spell": "Use a skill",
	"menu.keyboard.skip": "Skip a dialog",
	"interface.level": "Level :",
	"interface.puddle": "Remaining puddles :",
	"interface.life": "Life :",
	"interface.food": "Food :",
	"summary.synopsis": "Synopsis",
	"summary.tiles": "Tiles",
	"summary.slimes": "Slimes",
	"summary.editor": "Editor",
	"summary.synopsis.intro_1": "Syrup Slime is a game made in Javascript and using canvas to create an isometric map.",
	"summary.synopsis.intro_2": "",
	"summary.synopsis.intro_3": "The goal is to move the slime to each Belgian tile in order to create a syrup puddle on it. Perform the least movement as possible in order to finish the level with a star.",
	"summary.synopsis.intro_4": "As for the Slime tiles, when you pass on these tiles, the syrup of your Slime changes as well as your color giving you a special ability.",
	"summary.synopsis.intro_5": "On certain levels your life and/or food gauge will be activated. Then you will lose life when you pass over a green puddle and food on each move.",
	"summary.synopsis.intro_6": "In addition, every 10 levels you have to face an evil slime which will make you restart the entirely level if he touches you.",
	"summary.synopsis.resources": "The resources that made the game possible :",
	"summary.synopsis.resources_1": "Tiles and music are from OpenGameArt",
	"summary.synopsis.resources_2": "Icons are from Icons8",
	"summary.synopsis.resources_3": "The slime font is from ImageX Fonts",
	"summary.synopsis.resources_4": "The wallpaper is from Pixabay",
	"summary.tiles.beach.name": "Beach",
	"summary.tiles.beach.description": "All these tiles must be filled with syrup to complete the level.",
	"summary.tiles.grass.name": "Grass",
	"summary.tiles.grass.description": "If there is a food gauge, it allows you to feed otherwise it has no effect.",
	"summary.tiles.ice.name": "Ice",
	"summary.tiles.ice.description": "Allows you to slide until you find another tile or are at the edge of the void.",
	"summary.tiles.lava.name": "Lava",
	"summary.tiles.lava.description": "Instantly kill the slime causing the level to restart.",
	"summary.tiles.teleport.name": "Teleport",
	"summary.tiles.teleport.description": "This tile teleports the slime to another of the same type.",
	"summary.tiles.button.name": "Button",
	"summary.tiles.button.description": "Enable or disable footbridges allowing to pass over the void.",
	"summary.tiles.ink.name": "Ink",
	"summary.tiles.ink.description": "Green puddles turn yellow allowing you to move around them without danger and conversely.",
	"summary.tiles.lightning.name": "Lightning",
	"summary.tiles.lightning.description": "Modify the power of your special skill.",
	"summary.tiles.slime.name": "Slime",
	"summary.tiles.slime.description": "Change the syrup and the color of the slime in order to obtain a special skill.",
	"summary.slimes.green.name": "Apple slime",
	"summary.slimes.green.description": "The slime by default, has no skill.",
	"summary.slimes.red.name": "Strawberry slime",
	"summary.slimes.red.description": "Execute a dash that does not activate tiles but allows puddles to be placed.",
	"summary.slimes.red.enemy": "During a dash if you end up on the gray slime, he reappears on its original tile.",
	"summary.slimes.blue.name": "Blueberry slime",
	"summary.slimes.blue.description": "Place a blue puddle that doesn't loss you life and stay until you get this syrup again.",
	"summary.slimes.blue.enemy": "The gray slime can't walk on this blue puddle.",
	"summary.slimes.yellow.name": "Lemon slime",
	"summary.slimes.yellow.description": "Prevents losing food and allows you to stop puddles.",
	"summary.slimes.yellow.enemy": "Makes you invisible to gray slime.",
	"summary.slimes.purple.name": "Cassis slime",
	"summary.slimes.purple.description": "Throws a unique puddle allowing to deactivate the tile on which it is located.",
	"summary.slimes.purple.enemy": "If the puddle is thrown at the gray slime, he is pushed back one cell.",
	"summary.slimes.orange.name": "Peach slime",
	"summary.slimes.orange.description": "Allows you to place an orange puddle and teleport to an existing one.",
	"summary.slimes.orange.enemy": "If your teleport lands on the gray slime then your positions are swapped.",
	"summary.slimes.gray.name": "Gray slime",
	"summary.slimes.gray.description": "This slime will restart the level if you finish on the same tile as him.",
	"sumary.editor.description_1": "The life, food, grid and speech bubble are editable in order to define the map configuration.",
	"sumary.editor.description_2": "It is possible to load a pre-existing map in order to be able to play or modify it.",
	"sumary.editor.description_3": "In the menu bar, the play button allows you to test the map created and then download it.",
	"sumary.editor.description_4": "The score for the star is set to your best score. Going back to the editor deletes this data.",
	"sumary.editor.description_5": "The list of remaining tiles and options are available at the bottom right and are detailed below.",
	"sumary.editor.left_click": "Left click",
	"sumary.editor.right_click": "Right click",
	"sumary.editor.cursor.name": "Cursor",
	"sumary.editor.cursor.left": "Pastes the selected tile. Click can be maintained.",
	"sumary.editor.cursor.right": "Select the tile to copy with all its properties.",
	"sumary.editor.editor.name": "Editor",
	"sumary.editor.editor.left": "Increase the power or connects tiles together depending on the type of tile.",
	"sumary.editor.editor.right": "Decrease the power or connects tiles together depending on the type of tile.",
	"sumary.editor.eraser.name": "Eraser",
	"sumary.editor.eraser.left": "Delete a tile on the map. Click can be maintained.",
	"sumary.editor.eraser.right": "Select an area to erase. Click can be maintained.",
	"sumary.editor.tile.name": "Tile",
	"sumary.editor.tile.left": "Place a tile on the map. Click can be maintained.",
	"sumary.editor.tile.right": "Select an area to fill it with tiles. Click can be maintained.",
	"sumary.editor.slime.name": "Slime",
	"sumary.editor.slime.left": "Define the spawn of your slime as well as that of the enemy.",
	"sumary.editor.slime.right": "Change the direction where the slime looking.",
	"editor.grid": "Grid",
	"editor.load": "Load a map",
	"editor.status": "Status",
	"editor.retry": "Retry",
	"editor.download": "Download the map",
	"editor.modal.success": "The map has been completed successfully. Your best score is $1 move.",
	"editor.modal.error": "Your map contains errors, please correct them in order to be able to test the map :",
	"editor.modal.error.slime": "Your slime cannot appear on the current tile",
	"editor.modal.error.spawn": "You need to set a spawn",
	"editor.modal.error.enemy": "Enemy slime cannot spawn on the current tile",
	"dialog.init": "Use the menu at the top right to choose your level, configure the game or access to the editor",
	"dialog.slime.blue": "Remaining uses : $1",
	"dialog.slime.red": "Power rush : $1",
	"dialog.slime.yellow": "Number turns remaining : $1",
	"dialog.slime.purple": "Throw range : $1",
	"dialog.slime.orange": "Teleports remaining : $1",
	"dialog.game.level_1_1": "Plop, do you want to help me? Nothing very complicated you just have to move me using the keys indicated in the options at the top right or with the PAD at the bottom right.",
	"dialog.game.level_1_2": "You see this tiles <img src='images/tiles/beach.png'/> ? Every time I move on it I create a puddle. And if a puddle is already present, I remove it.",
	"dialog.game.level_1_3": "Your goal is to fill all these squares with puddles and if possible with the less move as possible to get the star. Your turn to play !",
	"dialog.game.level_2_1": "As you progress through the levels, new game mechanics will appear.",
	"dialog.game.level_2_2": "Here it is the life points. Every time I move on a puddle I lose 1. In this level there is no room for error!",
	"dialog.game.level_3_1": "This exercise made me hungry. Each time I move I lose 1 food point and once I reach 0 I will have to start all over again.",
	"dialog.game.level_3_2": "I'm a herbivore so to avoid this problem direct me to a grass square <img src='images/tiles/grass.png'/> so that I can eat there.",
	"dialog.game.level_4_1": "Brrrr it's cold here. On the other hand, it makes me want to slide on this ice <img src='images/tiles/ice.png'/>.",
	"dialog.game.level_4_2": "However, not being hungry, the grass tile seems totally useless... at least at first sight.",
	"dialog.game.level_5_1": "You see this lava <img src='images/tiles/lava.png'/> ? Above all, never finish on it. Slimes are composed at 95% water and as you know water evaporates in the heat...",
	"dialog.game.level_5_2": "Some boxes make us change color by modifying our organism to produce a special syrup. Should you try passing over this tiles <img src='images/tiles/red.png'/>.",
	"dialog.game.level_5_3": "This not only changes my color but also allows me to use a skill. Here I become a strawberry slime and can perform a dash without activating the effects of the tiles crossed.",
	"dialog.game.level_6_1": "Oh a teleporter <img src='images/tiles/teleport.png'/> ! You should try to take it.",
	"dialog.game.level_7_1": "This time we have a case <img src='images/tiles/blue.png'/> that turns me into blueberry slime. Basically I'm an apple slime :)",
	"dialog.game.level_7_2": "The ability obtained will be to place a blue puddle that cannot cause loss of life points and does not disappear until I return to this type of tile.",
	"dialog.game.level_8_1": "Come on, let's continue ! The tile <img src='images/tiles/yellow.png'/> also offers a skill, but this time it's a passive.",
	"dialog.game.level_8_2": "While i'm a lemon slime, I no longer puddles or consume food.",
	"dialog.game.level_9_1": "Go to the serious business. Use everything you have learned until now.",
	"dialog.game.level_10_1": "Oh no not him! This gray slime absorbs syrup from other slimes. Above all, do not meet him!",
	"dialog.game.level_10_2": "It is not affected by tile effects, but my skills yes.",
	"dialog.game.level_10_3": "The strawberry syrup rush causes the enemy to reappear on its original tile if you end in the same place than him.",
	"dialog.game.level_10_4": "The blueberry puddle prevents him to move on this tile.",
	"dialog.game.level_10_5": "The lemon syrup makes you invisible to her. Good luck !",
	"dialog.game.level_15_1": "A new mechanism is appearing, the controlled gateways.",
	"dialog.game.level_15_2": "When I walk on a button, it will cause white puddles to appear above the void that allow me to move above the void.",
	"dialog.game.level_15_3": "Buttons can also make them disappear and each of them controls specific areas.",
	"dialog.game.level_20_1": "Here it is again! You should try to make it fall into the void to give yourself some respite.",
	"dialog.game.level_23_1": "A new skill can be used if I become a cassis slime.",
	"dialog.game.level_23_2": "It will allow me to place a puddle from a distance and deactivate the tile on which it is located.",
	"dialog.game.level_23_3": "The puddle is thrown in the direction I'm looking and I can only land one. If I throw one back, the previous one evaporates.",
	"dialog.game.level_23_4": "Be careful, if I'm on this puddle and it dissolves, the tile I'm on will be activated.",
	"dialog.game.level_30_1": "If the purple puddle is thrown at the slime, then it will be pushed back one tile.",
	"dialog.game.level_32_1": "The tile with lightning <img src='images/tiles/lightning.png'/> allows you to modify the power of my skill. Here she just seems to reset me to green slime.",
	"dialog.game.level_35_1": "I can become a peach slime in this level. This allows me to lay an orange puddle on the sand and teleport to an existing one.",
	"dialog.game.level_38_1": "Do you see this tile with an ink stain <img src='images/tiles/ink.png'/> ? It allows you to recolor the green puddles in yellow in order to move there without losing life and vice versa.",
	"dialog.game.level_40_1": "If during a teleportation with an orange puddle the gray slime is on it, we will swap places.",
	"dialog.game.level_50_1": "The gray slime looks different from usual, it's like it has acquired an ability. Be careful !",
	"dialog.editor": "Dialogues"
}
