{
	"loader": "Chargement...",
	"menu.levels": "NIVEAUX",
	"menu.parameters": "PARAMETRES",
	"menu.configuration": "Configuration",
	"menu.language": "Langage",
	"menu.language.auto": "Automatique",
	"menu.language.english": "Anglais",
	"menu.language.french": "Français",
	"menu.animation": "Durée des animations",
	"menu.audio": "Volume audio",
	"menu.storage": "Sauvegarde des données",
	"menu.switch": "Non / Oui",
	"menu.keyboard": "Touches pour jouer",
	"menu.keyboard.top": "Se déplacer en haut à droite",
	"menu.keyboard.left": "Se déplacer en haut à gauche",
	"menu.keyboard.bot": "Se déplacer en bas à gauche",
	"menu.keyboard.right": "Se déplacer en bas à droite",
	"menu.keyboard.spell": "Utiliser une compétence",
	"menu.keyboard.skip": "Passer un dialogue",
	"interface.level": "Niveau :",
	"interface.puddle": "Flaques restantes :",
	"interface.life": "Vie :",
	"interface.food": "Nourriture :",
	"summary.synopsis": "Synopsis",
	"summary.tiles": "Cases",
	"summary.slimes": "Slimes",
	"summary.editor": "Editeur",
	"summary.synopsis.intro_1": "Syrup Slime est un jeu réalisé en Javascript et utilisant les canvas afin de créer une map isométrique.",
	"summary.synopsis.intro_2": "Le but est de déplacer le slime sur chaque case belge afin de créer une flaque de sirop sur celle-ci. Effectuer le moins de mouvement possible afin de finir le niveau avec une étoile.",
	"summary.synopsis.intro_3": "Vous trouverez différentes cases qui vous aideront... ou non à avancer dans le jeu. Ces cases sont rangées parmi 3 catégories : les cases d'environnement, les cases spéciales et les cases Slime.",
	"summary.synopsis.intro_4": "Pour ce qui est des cases Slime, lorsque vous passez sur ces cases, le sirop de votre Slime change ainsi que votre couleur vous offrant une capacité spéciale.",
	"summary.synopsis.intro_5": "Sur certains niveaux votre jauge de vie et/ou nourriture sera activée. Vous perdrez alors de la vie lorsque vous passerez sur une flaque verte et de la nourriture à chaque déplacement.",
	"summary.synopsis.intro_6": "De plus, tous les 10 niveaux vous devrez affronter un slime méchant qui vous fera entièrement recommencer le niveau s'il vous touche.",
	"summary.synopsis.resources": "Les ressources qui ont permis de créer le jeu :",
	"summary.synopsis.resources_1": "Les tuiles et musiques proviennent de OpenGameArt",
	"summary.synopsis.resources_2": "Les icônes proviennent de Icons8",
	"summary.synopsis.resources_3": "La police slime provient de ImageX Fonts",
	"summary.synopsis.resources_4": "Le fond d'écran provient de Pixabay",
	"summary.tiles.beach.name": "Sable",
	"summary.tiles.beach.description": "Toutes ces cases doivent être remplies de sirop pour finir le niveaux.",
	"summary.tiles.grass.name": "Herbe",
	"summary.tiles.grass.description": "Si présence d'une jauge de nourriture, elle permet de se nourrir sinon elle n'a aucun effet.",
	"summary.tiles.ice.name": "Glace",
	"summary.tiles.ice.description": "Permet de glisser jusqu'à rencontrer une autre case ou être au bord du vide.",
	"summary.tiles.lava.name": "Lave",
	"summary.tiles.lava.description": "Tue immédiatement le slime faisant recommencer le niveau.",
	"summary.tiles.teleport.name": "Téléportation",
	"summary.tiles.teleport.description": "Cette case téléporte le slime à une autre du même type.",
	"summary.tiles.button.name": "Bouton",
	"summary.tiles.button.description": "Active ou désactive des passerelles permettant de passer au dessus du vide.",
	"summary.tiles.ink.name": "Encre",
	"summary.tiles.ink.description": "Les flaques vertes deviennent jaunes permettant de s'y deplacer sans danger et inversement.",
	"summary.tiles.lightning.name": "Eclair",
	"summary.tiles.lightning.description": "Modifie la puissance de votre compétence spéciale.",
	"summary.tiles.slime.name": "Slime",
	"summary.tiles.slime.description": "Change le sirop et la couleur du slime afin d'obtenir une compétence spéciale.",
	"summary.slimes.green.name": "Slime pomme",
	"summary.slimes.green.description": "Le slime par défaut, ne possède aucune compétence.",
	"summary.slimes.red.name": "Slime fraise",
	"summary.slimes.red.description": "Éxécute une ruée qui n'active pas les cases mais permet de poser des flaques.",
	"summary.slimes.red.enemy": "Lors d'une ruée si vous terminez sur le slime gris, celui-ci réapparait sur sa case d'origine.",
	"summary.slimes.blue.name": "Slime myrtille",
	"summary.slimes.blue.description": "Pose une flaque bleue ne faisant pas perdre de vie et reste jusqu'à ravoir ce sirop.",
	"summary.slimes.blue.enemy": "Le slime gris ne peut pas marcher sur cette flaque bleue.",
	"summary.slimes.yellow.name": "Slime citron",
	"summary.slimes.yellow.description": "Empêche de perdre de la nourriture et permet de ne plus poser de flaques.",
	"summary.slimes.yellow.enemy": "Vous rend invisible aux yeux du slime gris.",
	"summary.slimes.purple.name": "Slime cassis",
	"summary.slimes.purple.description": "Lance une flaque unique permettant de désactiver la case sur laquelle elle se trouve.",
	"summary.slimes.purple.enemy": "Si la flaque est lancée sur le slime gris, celui-ci est repoussé d'une case.",
	"summary.slimes.orange.name": "Slime pêche",
	"summary.slimes.orange.description": "Permet de poser une flaque orange et de se téléporter à une déjà existante.",
	"summary.slimes.orange.enemy": "Si votre téléportation atterrit sur le slime gris alors vos positions sont échangées.",
	"summary.slimes.gray.name": "Slime gris",
	"summary.slimes.gray.description": "Ce slime fera recommencer le niveau si vous terminez sur la même case que lui.",
	"sumary.editor.description_1": "La vie, nourriture, grille et bulle de dialogue sont éditables afin de définir la configuration de la carte.",
	"sumary.editor.description_2": "Il est possible de charger une carte pré-existante afin de pouvoir la jouer ou la modifier.",
	"sumary.editor.description_3": "Dans la barre de menu, le bouton jouer permet de tester la carte réalisée puis la télécharger.",
	"sumary.editor.description_4": "Le score pour l'étoile est défini sur votre meilleur score. Revenir sur l'éditeur supprime cette donnée.",
	"sumary.editor.description_5": "La liste des tuiles et options restantes sont disponibles en bas à droite et sont détaillées ci-dessous.",
	"sumary.editor.left_click": "Clic gauche",
	"sumary.editor.right_click": "Clic droit",
	"sumary.editor.cursor.name": "Curseur",
	"sumary.editor.cursor.left": "Permet de coller la tuile qui est sélectionnée. Le clic peut-être maintenu.",
	"sumary.editor.cursor.right": "Sélectionne la tuile à copier avec toutes ses propriétés.",
	"sumary.editor.editor.name": "Editeur",
	"sumary.editor.editor.left": "Augmente la puissance ou relie des tuiles entre elles selon le type de case.",
	"sumary.editor.editor.right": "Diminue la puissance ou relie des tuiles entre elles selon le type de case.",
	"sumary.editor.eraser.name": "Gomme",
	"sumary.editor.eraser.left": "Supprime une tuile sur la carte. Le clic peut être maintenu.",
	"sumary.editor.eraser.right": "Sélectionne une zone pour l'effacer. Le clic peut être maintenu.",
	"sumary.editor.tile.name": "Tuile",
	"sumary.editor.tile.left": "Dépose une tuile sur la carte. Le clic peut être maintenu.",
	"sumary.editor.tile.right": "Sélectionne une zone pour y remplir de tuiles. Le clic peut être maintenu.",
	"sumary.editor.slime.name": "Slime",
	"sumary.editor.slime.left": "Défini le spawn de votre slime ainsi que celui de l'ennemi.",
	"sumary.editor.slime.right": "Change la direction vers laquelle le slime regarde.",
	"editor.grid": "Grille",
	"editor.load": "Charger une map",
	"editor.status": "Statut",
	"editor.retry": "Réessayer",
	"editor.download": "Télécharger la map",
	"editor.modal.success": "La carte a été réalisée avec succès. Votre meilleur score est de $1 coups.",
	"editor.modal.error": "Votre carte contient des erreurs, veuillez les corriger afin de pouvoir tester la map :",
	"editor.modal.error.slime": "Votre slime ne peut pas apparaître sur la case actuelle",
	"editor.modal.error.spawn": "Vous devez définir un spawn",
	"editor.modal.error.enemy": "Le slime ennemi ne peut pas apparaître sur la case actuelle",
	"dialog.init": "Utilisez le menu en haut à droite pour choisir votre niveau, paramétrer le jeu ou encore accéder à l'éditeur",
	"dialog.slime.blue": "Utilisations restantes : $1",
	"dialog.slime.red": "Puissance de la ruée : $1",
	"dialog.slime.yellow": "Nombre de tours restants : $1",
	"dialog.slime.purple": "Portée du lancer : $1",
	"dialog.slime.orange": "Téléportations restantes : $1",
	"dialog.game.level_1_1": "Plop, tu veux bien m'aider ? Rien de bien compliqué tu dois juste me déplacer à l'aide des touches indiquées dans les options en haut à droite ou avec le PAD en bas à droite.",
	"dialog.game.level_1_2": "Tu vois ces cases <img src='images/tiles/beach.png'/> ? A chaque fois que je me déplace dessus je crée une flaque. Et si une flaque est déjà présente je la retire.",
	"dialog.game.level_1_3": "Ton but est de remplir toutes ces cases avec des flaques et si possible avec le moins de coup possible pour obtenir l'étoile. A toi de jouer !",
	"dialog.game.level_2_1": "Au fur et à mesure qu'on avance dans les niveaux, de nouvelles mécaniques de jeu feront leurs apparitions.",
	"dialog.game.level_2_2": "Ici c'est les points de vie. A chaque fois que je me déplace sur une flaque j'en perds 1. Dans ce niveau pas le droit à l'erreur !",
	"dialog.game.level_3_1": "Ca m'a donné faim tout cet exercice. A chaque fois je me déplace je perds 1 point de nourriture et une fois arrivé à 0 il faudra tout recommencer.",
	"dialog.game.level_3_2": "Je suis herbivore donc pour éviter ce problème dirige moi sur une case d'herbe <img src='images/tiles/grass.png'/> pour que je puisse m'y restaurer.",
	"dialog.game.level_4_1": "Brrrr il fait froid ici. Par contre ca me donne envie de glisser sur cette glace <img src='images/tiles/ice.png'/>.",
	"dialog.game.level_4_2": "Néanmoins n'ayant pas faim la case d'herbe semble totalement inutile... du moins à première vue.",
	"dialog.game.level_5_1": "Tu vois cette lave <img src='images/tiles/lava.png'/> ? Surtout ne fini jamais dessus. Nous les slimes nous sommes composés à 95% d'eau et comme tu le sais l'eau s'évapore à la chaleur...",
	"dialog.game.level_5_2": "Certaines cases nous font changer de couleur en modifiant notre organisme pour produire un sirop spécial. Tu devrais essayer en passant sur cette case <img src='images/tiles/red.png'/>.",
	"dialog.game.level_5_3": "Celà ne modifie pas seulement ma couleur mais permet aussi d'utiliser une compétence. Ici je deviens un slime fraise et peux effectuer une ruée sans activer les effets des cases traversées.",
	"dialog.game.level_6_1": "Oh un téléporteur <img src='images/tiles/teleport.png'/> ! Tu devrais essayer de le prendre.",
	"dialog.game.level_7_1": "Cette fois on a un case <img src='images/tiles/blue.png'/> qui me transforme en slime myrtille. En fait de base je suis un slime pomme :)",
	"dialog.game.level_7_2": "La capacité obtenue sera de poser un flaque bleue qui ne peut pas faire perdre de point de vie et ne dispraît pas tant que je ne retourne pas sur ce type de case.",
	"dialog.game.level_8_1": "Allez on enchaîne ! La case <img src='images/tiles/yellow.png'/> offre aussi une compétence mais cette fois-ci c'est un passif.",
	"dialog.game.level_8_2": "Tant que je suis en slime citron, je ne pose plus de flaque et ne consomme plus de nourriture.",
	"dialog.game.level_9_1": "On passe aux choses sérieuses. Utilise tout ce que tu as appris jusqu'à maintenant.",
	"dialog.game.level_10_1": "Oh non pas lui ! Ce slime gris absorbe le sirop des autres slimes. Ne le rencontre surtout pas !",
	"dialog.game.level_10_2": "Il n'est pas affecté par les effets des cases par contre les compétences en ont un.",
	"dialog.game.level_10_3": "La ruée effectuée grâce au sirop fraise fait réapparaître l'ennemi sur sa case d'origine si vous finissez au même endroit.",
	"dialog.game.level_10_4": "La flaque du sirop myrtille l'empêche de se déplacer sur cette case.",
	"dialog.game.level_10_5": "Le sirop citron te rend invisible à ses yeux. Bonne chance !",
	"dialog.game.level_15_1": "Une nouvelle mécanique fait son apparition, il s'agit des passerelles commandées.",
	"dialog.game.level_15_2": "Lorsque que je marche sur un bouton, celui-ci va faire apparaître des flaques blanches au dessus du vide qui me permettent de marcher au dessus du vide.",
	"dialog.game.level_15_3": "Les boutons peuvent aussi les faire disparaître et chacun d'entre eux contrôle des zones spécifiques.",
	"dialog.game.level_20_1": "Le revoilà ! Tu devrais essayer de le faire tomber dans le vide pour te laisser du répit.",
	"dialog.game.level_23_1": "Un nouvelle compétence peut-être utilisée si je deviens un slime cassis.",
	"dialog.game.level_23_2": "Elle me permettra de poser une flaque à distance et de désactiver la case sur laquelle elle se trouve.",
	"dialog.game.level_23_3": "La flaque est lancée dans la direction où je regarde et je ne peux en poser qu'une seule. Si j'en relance une la précédente s'évapore.",
	"dialog.game.level_23_4": "Attention, si je suis sur cette flaque et qu'elle se dissout, la case sur laquelle je suis sera activée.",
	"dialog.game.level_30_1": "Si on lance la flaque violette sur le slime, alors il sera repoussé d'une case.",
	"dialog.game.level_32_1": "La case avec l'éclair <img src='images/tiles/lightning.png'/> permet de modifier la puissance de mes compétences. Ici elle semble juste me réinitailiser en slime vert.",
	"dialog.game.level_35_1": "Je peux devenir un slime pêche dans ce niveau. Cela me permet de poser une flaque orange sur le sable et de me téléporter à une autre existante.",
	"dialog.game.level_38_1": "Tu vois cette case avec une tâche d'encre <img src='images/tiles/ink.png'/> ? Elle permet de recolorer les flaques vertes en jaune afin de s'y deplacer sans perdre de la vie et inversement.",
	"dialog.game.level_40_1": "Si lors d'une téléportation avec une flaque orange le slime gris se trouve dessus, on échangera nos place.",
	"dialog.game.level_50_1": "Le slime gris semble différent de d'habitude, c'est comme s'il avait acquis une aptitude. Fais attention !",
	"dialog.editor": "Dialogues"
}
